using System.Collections;
using System.Collections.Generic;
using UnityEngine;
using UnityEngine.UI;
using UnityEngine.SceneManagement;

public class Q1 : BasePanel
{
	public GameObject go;
	Text tex;
	private int N;
	private int cur_id;
	private Button btn;
	
	static readonly string path = "Prefabs/Panel/Q1.1";
	
	private string[] q= new string[] {
"1、使用灭火器灭火时，要对准火焰的（ ）喷射。",
"2、当打开房门闻到煤气气味时怎么办？（ ）",
"3、带电的电气设备以及发电机、电动机等应使用（ ）灭火",
"4、 公安消防队扑救火灾（ ）",
"5、火场中防止烟气危害最简单的方法是（ ）",
"6、 家用电器发生火灾，在没有灭火器的情况下应先（ ）",
"7、 泡沫灭火器不能用于扑救（ ）火灾。",
"8、下列()措施不能阻止火势蔓延。",
"9、高层建筑发生火灾时，受灾人员可以通过下列（）方式逃生",
"10、身上着火后,下列哪种灭火方法是错误的( )",
"11. 台风预警信号，从弱到强的顺序为（ ）",
"12. 台风来临前，应该准备的物资有（ ）",
"13. 台风来临前，应该做到（ ）",
"14. 台风来临时，居家应做到（ ）",
"15. 台风来临时，在外应做到（ ）",
"16. 台风来临时，以下做法正确的是（ ）",
"17. 台风来临时，以下做法正确的是（ ）",
"18. 台风过后，以下做法中存在错误的是（ ）",
"19. 台风过后，家门口出现积水时，以下做法错误的是（ ）",
"20. 在雨天发现电杆倒杆、电力线路断落、线路放电时，错误的做法是（ ）",
"21、在影剧院、体育馆等处避震，应就地( ) 或趴在排椅下",
"22、在户外避震应就地选择( )避震，蹲下或趴下，以免摔倒。",
"23、在农村平房居住时，当地震突然降临时 ( )",
"24、在城市，一旦被地震埋在废墟内，应该 ( )。",
"25、在学校上课遇到地震时，要在教师指指挥下，迅速抱头，躲在（ )。",
"26、在操场或室外遇到地震时，可原地蹲下， 双手保护( )。",
"27、在公共场所避震，应听从现场工作人员的指挥( )拥向出口，避免被挤到墙壁或栅栏处。",
"28、乘坐正在行驶的汽车遇到地震时，要( )重心，躲在座位附近，等地震过去后再下车。",
"29、临震预警是指对( )内将要发生地震的时间、地点、震级的预报。",
"30、地震中期预报是指对未来( )内可能发生破坏性地震的地域和强度的预报。",
"31、洪水来临时，危险地带有（ ）",
"32、洪涝灾害期间，以下不可饮用的是（ ）",
"33、防止洪水涌入室内，以下做法正确的是（ ）",
"34、暴雨时，不能在马路两侧行走的原因有（ ）",
"35、洪水来袭，已经来不及转移时，不应该（ ）",
"36、驾车遭遇洪水时，以下错误的做法是（ ）",
"37、泥石流发生的征兆有( )",
"38、在遇到泥石流的时候，应如何自救（ ）",
"39、在遇到泥石流的时候，应如何自救（ ）",
"40、以下防泥石流安全知识正确的是（ ）",
"41、遇伤员被挤压、夹嵌在事故车内时：（ ）",
"42、车祸发生时：（ ）",
"43、当交通事故发生后，应迅速向（ ) 求救",
"44、翻车已不可避免，需要跳车时，不应：（ ）",
"45、发生交通事故应该：（ ）",
"46、在车祸现场：（ ）",
"47、车辆意外失火时，应：（ ）",
"48、非机动车如何提高安全性：（ ）",
"49、当车辆迎面碰撞时：（ ）",
"50、车辆落水时：（ ）"};

	private string[] a_content=new string[]{
"A、上部",
"A、打开煤气灶具查找漏气部位",
"A、水",
"A、只收灭火器材药剂耗损费 ",
"A、跳楼 ",
"A、用水扑救",
"A、塑料",
"A、关闭防火门",
"A、疏散楼梯",
"A、就地打滚",
"A、蓝色、黄色、橙色、红色",
"A、食物、饮用水",
"A、将阳台、窗户、屋顶等的易坠物品转移到室内或其他安全地方",
"A、切勿靠近窗户，以免被强风吹破的窗玻璃片弄伤",
"A、远离高大建筑，注意高空坠物",
"A、到海边游泳、钓鱼、观潮或戏水",
"A、在高空及户外进行危险作业",
"A、检查房屋、门窗是否牢固",
"A、凭借老经验走路",
"A、单脚跳离8米外",
"A、站立",
"A、楼房边 ",
"A、保护财产 ",
"A、冷静观察，尽量自救，保存实力，等待救援",
"A、窗口旁 ",
"A、头部",
"A、应该",
"A、提高",
"A、10日",
"A、三个月",
"A、马路两侧",
"A、瓶装水",
"A、用沙袋、土袋在门槛和窗户处筑起防线",
"A、因低洼的地形，马路两侧是最易存水的地方，在积水中不易辨别情况",
"A、立即爬上高处暂时避险。",
"A、立刻冲出车门，弃车逃至地势较高的地方。",
"A、山体出现很多白色水流，山坡变形、鼓包、裂缝，甚至坡上物体出现倾斜。",
"A、往地势空旷、树木生长稀疏的地方逃生。",
"A、朝与泥石流方向垂直的两边撤离。",
"A、泥石流发生时，在坡度大，土层厚的凹处躲避。",
"A、尽量避免暴力硬拉等方法",
"A、驾乘者应沉着冷静",
"A、消防(119)、交通(122)、急救中心(120）",
"A、用力蹬双脚，增大向外抛出的力量和距离",
"A、立即停车",
"A、保护现场的原始状态",
"A、破窗脱身打滚灭火",
"A、佩戴头盔 ",
"A、两脚踏直身体后倾 ",
"A、先深呼吸再开车门"};

	private string[] b_content=new string[]{
"B、中部",
"B、打开灯查找漏气部位",
"B、泡沫",
"B、收取人工费用",
"B、大声呼救",
"B、用毛毯包裹",
"B、金属钠",
"B、打开门窗通风",
"B、电梯",
"B、用厚重衣物覆盖压灭火苗",
"B、黄色、蓝色、橙色、红色",
"B、药品、日用品",
"B、加固室外悬空、高空设施以及简易、临时建筑物，必要时拆除",
"B、尽量拔掉不必要的电源插头，切断危险的室外电源",
"B、不要接近倾倒的高压线铁塔、低垂或断折的电线",
"B、在河边、海塘或小桥上行走",
"B、在露天场所或室内举行大型集会",
"B、检查电器设备，如遇短路问题，可自行维修",
"B、绕开积水走路",
"B、拨打95598供电服务热线或110进行报案",
"B、蹲下",
"B、开阔地",
"B、应迅速躲到坚固支撑物底下，再伺机跑到户外 ",
"B、大声喊叫",
"B、课桌下",
"B、腹部",
"B、必须",
"B、降低",
"B、三个月",
"B、半年",
"B、地下通道",
"B、烧开的自来水 ",
"B、用胶带纸密封所有门窗的缝隙，多封几层",
"B、两侧埋有下水管线及其他管道，当窖井的盖子丢失时，贸然踏入会伤及自身",
"B、抓住身边存在的漂浮物。",
"B、继续在已被洪水淹没的公路上行驶。",
"B、 河（沟）床中正常流水突然断流或洪水突然增大，并夹有较多的柴草、树木。",
"B、就近选择树木生长密集可阻挡泥石流流速的地带逃生。",
"B、朝泥石流下游方向撤离。",
"B、在山区沟谷中游玩时，在沟道处或沟内的低平处搭建宿营棚。",
"B、应等待专业救援人员",
"B、保持清醒的头脑",
"B、就近单位、村镇",
"B、顺着翻车的方向跳车",
"B、开启危险报警闪光灯，如夜间还需开示宽灯、尾灯",
"B、不故意破坏、伪造现场",
"B、立即熄火、切断油路和电源",
"B、遇到抢道时，应视情况降低车速",
"B、保持身体平衡",
"B、头部尽量保持在水面上"
};

	private string[] c_content=new string[]{
"C、根部",
"C、打开窗门通风",
"C、干式灭火器、二氧化碳灭火器或 1211灭火器",
"C、不收取任何费用",
"C、用毛巾或衣服捂住口鼻低姿势沿疏散通道",
"C、切断电源",
"C、煤油",
"C、降下防火卷帘",
"C、跳楼 ",
"C、迎风快跑",
"C、黄色、橙色、红色、蓝色",
"C、手电筒等应急设备",
"C、将低洼地段、江边河边等易涝房屋内的物品转移到高处",
"C、清理排水管道、保持排水畅通",
"C、避免骑行出门，应选择步行或乘坐交通工具",
"C、在强风影响区域开车",
"C、出海船只及时回港避风",
"C、及时清理家中积水，并喷洒消毒水",
"C、绕不开时，用木棍试探",
"C、发现有人触电，直接上前救助触电者",
"C、快跑",
"C、水塔下 ",
"C、应立即躲到墙根下",
"C、拼命争扎",
"C、课桌边 ",
"C、胸部",
"C、不要",
"C、保持",
"C、半年",
"C、1—2年",
"C、高架桥下面的通道",
"C、救灾指挥部认可的饮用水",
"C、堵死老鼠洞、排水洞等一切可能进水的地方",
"C、马路中央积水中可能存在其他危险，如遇漩涡应绕行",
"C、单身游水转移。",
"C、如不小心进入被洪水淹没的地区，应爬上车顶，大声呼救。",
"C、 山沟或深谷发出轰鸣声音或有轻微的震动感。",
"C、停留在陡峻的山坡或者爬树躲避。",
"C、朝泥石流上游方向撤离。",
"C、长时间降雨或暴雨渐小之后或雨刚停不能马上返回危险区。",
"C、非专业人士不盲目救援",
"C、及时寻求救援",
"C、可拦截过往车辆",
"C、逆着翻车的方向跳车",
"C、在高速公路上还需在车后按规定设置危险警告标志。",
"C、可用绳索等设置警戒线，保护好现场",
"C、组织车内人员迅速离开车体",
"C、后座尽量不坐人",
"C、驾驶人应迅速躲离方向盘，将两脚抬起",
"C、水较深时，先不急于打开车门"
};

	private string[] d_content=new string[]{
"D、以上都可以",
"D、以上都可以",
"D、干砂",
"D、根据情况收取适当费用",
"D、憋气逃生",
"D、以上都可以",
"D、以上都不适用",
"D、转移易燃物品",
"D、货梯",
"D、能脱下衣服则脱下衣服",
"D、红色、橙色、黄色、蓝色",
"D、以上都是",
"D、以上都是",
"D、以上都是",
"D、以上都是",
"D、尽量避免外出",
"D、前往台风经过地旅游",
"D、及时丢弃受潮的食物",
"D、以上都是",
"D、阻止他人靠近",
"D、原地待命",
"D、人聚集处",
"D、立刻跑到户外",
"D、不需要救援，自力更生，拨开埋压物",
"D、墙脚",
"D、背部",
"D、随意",
"D、以上都可以",
"D、1—2年",
"D、10年",
"D、以上都是",
"D、未经处理的地表水",
"D、以上都对",
"D、以上全是",
"D、利用船只、木排、门板、木床等水上转移。",
"D、当汽车沉默在水中时，摇起车窗，打开所有车灯，进行求救。",
"D、以上都是。",
"D、往开阔的低地逃生。",
"D、停在原地等待救援。",
"D、在凹形陡坡危岩突出的地方避雨、休息和穿行。",
"D、以上都对",
"D、以上都对",
"D、以上都对",
"D、尽量避免跳出后又被车辆重新压上。",
"D、以上都对",
"D、以上都对",
"D、以上都对",
"D、以上都对",
"D、以上都对",
"D、以上都对",
};


	private int now_choose;
	private int[,] TF=new int[,]{
		{-1,0,0,0,0,0,0,0,0,1,0,1,0,0,0,0,0,0,0,1,0,0,0,0,1,0,1,0,0,1,0,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0,0},

		{-1,0,0,0,0,0,0,1,1,0,0,0,0,0,0,0,0,0,1,0,0,1,1,1,0,1,0,0,1,0,0,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,0,0,0},

		{-1,1,1,1,1,1,1,0,0,0,1,0,0,0,0,0,0,1,0,0,1,0,0,0,0,0,0,1,0,0,1,0,0,0,0,1,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0},

		{-1,0,0,0,0,0,0,0,0,0,0,0,1,1,1,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,1,1,0,0,1,0,0,0,1,1,1,0,1,1,1,1,1,1}

	};

	public Q1():base(new UIType(path)){}
	
	public override void OnEnter(){
		go=GameObject.Find("EventSystem");
		N=10;cur_id=0;now_choose=0;
		nextP();
		UITool.GetOrAddComponentInChildren<Button>("A").onClick.AddListener(()=>{
			now_choose=0;
			nextP();
		});
		UITool.GetOrAddComponentInChildren<Button>("B").onClick.AddListener(()=>{
			now_choose=1;
			nextP();
		});
		UITool.GetOrAddComponentInChildren<Button>("C").onClick.AddListener(()=>{
			now_choose=2;
			nextP();
		});
		UITool.GetOrAddComponentInChildren<Button>("D").onClick.AddListener(()=>{
			now_choose=3;
			nextP();
		});
		UITool.GetOrAddComponentInChildren<Button>("Exit").onClick.AddListener(()=>{
			SceneManager.LoadScene("MainMenu");
		});
	}
	void nextP(){
		if(TF[now_choose,cur_id]==1)
			go.GetComponent<Cnt>().T++;
		else if(TF[now_choose,cur_id]==0)
			go.GetComponent<Cnt>().F++;
		if(cur_id==N){
			PanelManager.Push(new CntP());
			return;
		}
		tex=UITool.GetOrAddComponentInChildren<Text>("Q");
		tex.text=q[cur_id];
		tex=GameObject.Find("A/Text").GetComponent<Text>();
		tex.text=a_content[cur_id];
		tex=GameObject.Find("B/Text").GetComponent<Text>();
		tex.text=b_content[cur_id];
		tex=GameObject.Find("C/Text").GetComponent<Text>();
		tex.text=c_content[cur_id];
		tex=GameObject.Find("D/Text").GetComponent<Text>();
		tex.text=d_content[cur_id];
		tex = UITool.GetOrAddComponentInChildren<Text>("Cnt");
		tex.text="正确:"+go.GetComponent<Cnt>().T+"  错误:"+go.GetComponent<Cnt>().F;
		cur_id++;
	}
}